In [1]:
import os
import sys
# 引入日历模块
import calendar
import matplotlib
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import baostock as bs
import tushare as ts
from datetime import datetime, timedelta
%matplotlib inline
%config InlineBackend.figure_format = 'svg'

In [2]:
lg = bs.login()

login success!

In [3]:
df = ts.get_realtime_quotes('601398') #Single stock symbol
df[['code','name','price','bid','ask','volume','amount','time']]

     code  name  price    bid    ask     volume          amount      time
0  601398  工商银行  5.690  5.680  5.690  199253584  1122075310.000  15:00:00

In [4]:
df.to_json(force_ascii=False)

'{"name":{"0":"工商银行"},"open":{"0":"5.660"},"pre_close":{"0":"5.650"},"price":{"0":"5.690"},"high":{"0":"5.760"},"low":{"0":"5.570"},"bid":{"0":"5.680"},"ask":{"0":"5.690"},"volume":{"0":"199253584"},"amount":{"0":"1122075310.000"},"b1_v":{"0":"2615"},"b1_p":{"0":"5.680"},"b2_v":{"0":"2673"},"b2_p":{"0":"5.670"},"b3_v":{"0":"2224"},"b3_p":{"0":"5.660"},"b4_v":{"0":"1852"},"b4_p":{"0":"5.650"},"b5_v":{"0":"5334"},"b5_p":{"0":"5.640"},"a1_v":{"0":"26064"},"a1_p":{"0":"5.690"},"a2_v":{"0":"12233"},"a2_p":{"0":"5.700"},"a3_v":{"0":"24695"},"a3_p":{"0":"5.710"},"a4_v":{"0":"5894"},"a4_p":{"0":"5.720"},"a5_v":{"0":"5740"},"a5_p":{"0":"5.730"},"date":{"0":"2018-10-26"},"time":{"0":"15:00:00"},"code":{"0":"601398"}}'

In [5]:
pd.read_json(_,)

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.66,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398

In [6]:
wf = open("./realtime.json", "w+")

In [7]:
wf.write(df.to_json(force_ascii=False)+"\n")
wf.write(df.to_json(force_ascii=False)+"\n")
wf.write(df.to_json(force_ascii=False)+"\n")

716

In [8]:
wf.flush()
wf.close()

In [9]:
rf = open("./realtime.json", "r")

In [10]:
row=rf.readline()
print(row)

{"name":{"0":"工商银行"},"open":{"0":"5.660"},"pre_close":{"0":"5.650"},"price":{"0":"5.690"},"high":{"0":"5.760"},"low":{"0":"5.570"},"bid":{"0":"5.680"},"ask":{"0":"5.690"},"volume":{"0":"199253584"},"amount":{"0":"1122075310.000"},"b1_v":{"0":"2615"},"b1_p":{"0":"5.680"},"b2_v":{"0":"2673"},"b2_p":{"0":"5.670"},"b3_v":{"0":"2224"},"b3_p":{"0":"5.660"},"b4_v":{"0":"1852"},"b4_p":{"0":"5.650"},"b5_v":{"0":"5334"},"b5_p":{"0":"5.640"},"a1_v":{"0":"26064"},"a1_p":{"0":"5.690"},"a2_v":{"0":"12233"},"a2_p":{"0":"5.700"},"a3_v":{"0":"24695"},"a3_p":{"0":"5.710"},"a4_v":{"0":"5894"},"a4_p":{"0":"5.720"},"a5_v":{"0":"5740"},"a5_p":{"0":"5.730"},"date":{"0":"2018-10-26"},"time":{"0":"15:00:00"},"code":{"0":"601398"}}

In [11]:
pd_row0=pd.read_json(row)
pd_row1=pd.read_json(row)

In [12]:
pd_row0

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.66,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398

In [13]:
pd_row1[['open']] = 5.5
pd_row1

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.5,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398

In [14]:
df = pd_row0.append(pd_row1)

In [15]:
pd_row1

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.5,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398

In [16]:
df

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.66,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398
0,工商银行,5.50,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-26,15:00:00,601398

In [28]:
df = df.reset_index(drop=True)

In [29]:
df['date'] = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

In [30]:
df

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.66,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-28 11:33:53,15:00:00,601398
1,工商银行,5.50,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-28 11:33:53,15:00:00,601398

In [31]:
df.to_json(force_ascii=False)

'{"name":{"0":"工商银行","1":"工商银行"},"open":{"0":5.66,"1":5.5},"pre_close":{"0":5.65,"1":5.65},"price":{"0":5.69,"1":5.69},"high":{"0":5.76,"1":5.76},"low":{"0":5.57,"1":5.57},"bid":{"0":5.68,"1":5.68},"ask":{"0":5.69,"1":5.69},"volume":{"0":199253584,"1":199253584},"amount":{"0":1122075310,"1":1122075310},"b1_v":{"0":2615,"1":2615},"b1_p":{"0":5.68,"1":5.68},"b2_v":{"0":2673,"1":2673},"b2_p":{"0":5.67,"1":5.67},"b3_v":{"0":2224,"1":2224},"b3_p":{"0":5.66,"1":5.66},"b4_v":{"0":1852,"1":1852},"b4_p":{"0":5.65,"1":5.65},"b5_v":{"0":5334,"1":5334},"b5_p":{"0":5.64,"1":5.64},"a1_v":{"0":26064,"1":26064},"a1_p":{"0":5.69,"1":5.69},"a2_v":{"0":12233,"1":12233},"a2_p":{"0":5.7,"1":5.7},"a3_v":{"0":24695,"1":24695},"a3_p":{"0":5.71,"1":5.71},"a4_v":{"0":5894,"1":5894},"a4_p":{"0":5.72,"1":5.72},"a5_v":{"0":5740,"1":5740},"a5_p":{"0":5.73,"1":5.73},"date":{"0":"2018-10-28 11:33:53","1":"2018-10-28 11:33:53"},"time":{"0":"15:00:00","1":"15:00:00"},"code":{"0":601398,"1":601398}}'

In [32]:
pd.read_json(_,)

,name,open,pre_close,price,high,low,bid,ask,volume,amount,...,a2_p,a3_v,a3_p,a4_v,a4_p,a5_v,a5_p,date,time,code
0,工商银行,5.66,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-28 11:33:53,15:00:00,601398
1,工商银行,5.50,5.65,5.69,5.76,5.57,5.68,5.69,199253584,1122075310,...,5.7,24695,5.71,5894,5.72,5740,5.73,2018-10-28 11:33:53,15:00:00,601398